using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


/*
 * Задание 1. Таблица значений функции
 * Вычислить и вывести на экран в виде таблицы значения функции, заданной графически (см. задание 1 лабораторной работы 2), 
 * на интервале от хнач до хкон„ с шагом dx. Интервал и шаг задать таким образом, чтобы проверить все ветви программы.
 * Таблицу снабдить заголовком и шапкой.
 * Задание 2. Серия выстрелов по мишени
 * Для десяти выстрелов, координаты которых задаются с клавиатуры, вывести текстовые сообщения о попадании в мишень 
 * из задания 2 лабораторной работы 2. 
 */
namespace lab3
{
    class Program
    {
        static void Main(string[] args)
        {


        }
    }
}
